/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   pipe_redir.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jiychoi <jiychoi@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/10 15:34:00 by jiychoi           #+#    #+#             */
/*   Updated: 2021/10/10 15:50:29 by jiychoi          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

int	minishell_pipe()

//테스트용 메인문
int	main(int argc, char *argv[], char *envp[])
{
	char *cmd[] = {"cat", "cat", "cat"};
	char *flags[] = {"-e", "-e", "-e"};

	pipe
}
